Repository: amITranquil/price_list
Catalog: lib/l10n/app_*.arb
Languages: tr

# appTitle
source: Price Calculator
tr: Fiyat Hesaplayıcı

source: Exchange Rates
tr: Döviz Kurları

source: USD Rate
tr: USD Kuru

source: EUR Rate
tr: EUR Kuru

source: Bank selling rate
tr: Banka satış kuru

source: Loading...
tr: Yükleniyor...

source: Refresh rates
tr: Kurları yenile

source: Product Pricing
tr: Ürün Fiyatlandırması

source: Original Price
tr: Orijinal Fiyat

# enterPriceHelp
source: Enter price in USD or EUR
tr: USD veya EUR cinsinden fiyat girin

source: Currency:
tr: Para Birimi:

source: Saved Presets
tr: Kayıtlı Presetler

# selectPreset
source: Select a preset (optional)
tr: Preset seçin (opsiyonel)

source: Manual input
tr: Manuel giriş

# discountsAndProfit
source: Discounts & Profit
tr: İskontolar ve Kar

# tapToConfigureDiscounts
source: Tap to configure discounts and profit margin
tr: İskonto ve kar marjını yapılandırmak için dokunun

source: Discount 1 (%)
tr: İskonto 1 (%)

source: Discount 2 (%)
tr: İskonto 2 (%)

source: Discount 3 (%)
tr: İskonto 3 (%)

source: Profit Margin (%)
tr: Kar Marjı (%)

source: Calculate Price
tr: Fiyat Hesapla

source: Calculating...
tr: Hesaplanıyor...

source: Calculation Results
tr: Hesaplama Sonuçları

source: Converted Price
tr: Dönüştürülen Fiyat

source: Purchase Price
tr: Alış Fiyatı

source: Purchase + Tax
tr: Alış + Vergi

source: Sale Price
tr: Satış Fiyatı

# finalPriceVat
source: Final Price (with VAT)
tr: Final Fiyat (KDV Dahil)

source: PIN Code
tr: PIN Kodu

# enterPinHelp
source: Enter PIN to view purchase prices
tr: Alış fiyatlarını görmek için PIN girin

source: Show
tr: Göster

source: Hide
tr: Gizle

source: Save Current Settings
tr: Mevcut Ayarları Kaydet

source: Preset Name
tr: Preset Adı

# presetNameHint
source: e.g., Supplier A, Category B
tr: örn: Tedarikçi A, Kategori B

source: Save Current Values
tr: Mevcut Değerleri Kaydet

source: Delete Selected
tr: Seçili Olanı Sil

source: Update PIN
tr: PIN Güncelle

source: Settings
tr: Ayarlar

source: Language
tr: Dil

source: Turkish
tr: Türkçe

source: English
tr: İngilizce

# originalPriceEmpty
source: Original price cannot be empty!
tr: Orijinal fiyat boş bırakılamaz!

source: Incorrect PIN!
tr: Yanlış PIN!

# presetLabelEmpty
source: Preset label cannot be empty!
tr: Preset etiketi boş bırakılamaz!

# presetSaved
source: Preset saved successfully!
tr: Preset başarıyla kaydedildi!

source: Preset deleted!
tr: Preset silindi!

# errorSavingPreset
source: Error saving preset: Invalid numbers
tr: Preset kaydetme hatası: Geçersiz sayılar

# errorCalculation
source: Error in calculation: Please check your inputs
tr: Hesaplama hatası: Lütfen girişlerinizi kontrol edin

source: Data unavailable
tr: Veri mevcut değil

source: Data Source:
tr: Veri Kaynağı:

# calculationRecordsTooltip
source: Calculation Records
tr: Hesap Kayıtları

# saveCalculationTitle
source: Save Calculation
tr: Hesabı Kaydet

# productNameLabel
source: Product Name
tr: Ürün Adı

# productNameHint
source: Enter the name of the product you calculated
tr: Hesapladığınız ürünün adını girin

# notesLabel
source: Notes (Optional)
tr: Notlar (Opsiyonel)

# notesHint
source: Additional information or notes
tr: Ek bilgiler veya notlar

# saveCalculationButton
source: Save Calculation
tr: Hesabı Kaydet

# productNameRequired
source: Product name is required
tr: Ürün adı gerekli

# calculationRequired
source: You must perform a calculation first
tr: Önce hesaplama yapmalısınız

source: Calculation saved
tr: Hesap kaydedildi

# saveError
source: Save error: {error}
tr: Kaydetme hatası: {error}

# recordsLoadError
source: Error loading records: {error}
tr: Kayıtlar yüklenirken hata: {error}

source: Record deleted
tr: Kayıt silindi

# deleteError
source: Delete error: {error}
tr: Silme hatası: {error}

# deleteRecordTitle
source: Delete Record
tr: Kayıt Sil

# deleteConfirmation
source: Are you sure you want to delete the record for {productName}?
tr: {productName} kaydını silmek istediğinize emin misiniz?

source: Cancel
tr: İptal

source: Delete
tr: Sil

# calculationRecordsTitle
source: Calculation Records
tr: Hesap Kayıtları

source: Export Records
tr: Dışarı Aktar

source: Import Records
tr: İçeri Aktar

# searchHint
source: Search in product names or notes...
tr: Ürün adı veya notlarda ara...

source: No records yet
tr: Henüz kayıt yok

# noSearchResults
source: No search results found
tr: Arama sonucu bulunamadı

source: No records to export
tr: Dışarı aktarılacak kayıt bulunamadı

# exportSuccess
source: Data exported successfully
tr: Veri başarıyla dışa aktarıldı

# exportError
source: Export error: {error}
tr: Dışa aktarma hatası: {error}

# fileSaved
source: File saved: {path}
tr: Dosya kaydedildi: {path}

# fileSaveError
source: File save error: {error}
tr: Dosya kaydetme hatası: {error}

# importError
source: Import error: {error}
tr: İçe aktarma hatası: {error}

# fileReadError
source: File read error: {error}
tr: Dosya okuma hatası: {error}

# jsonContentEmpty
source: JSON content is empty
tr: JSON içeriği boş

# importSuccess
source: Data imported successfully
tr: Veri başarıyla içe aktarıldı

source: Price updated
tr: Fiyat güncellendi

# updateError
source: Update error: {error}
tr: Güncelleme hatası: {error}

# exchangeRateLoadError
source: Exchange rate information could not be loaded
tr: Kur bilgisi yüklenemedi

# updatePriceButton
source: Update
tr: Güncelle

# saveRecordsDialogTitle
source: Save Calculation Records
tr: Hesap Kayıtlarını Kaydet

# selectRecordsDialogTitle
source: Select Calculation Records
tr: Hesap Kayıtlarını Seç

# originalPriceDetail
source: Original Price
tr: Orijinal Fiyat

# calculatedPriceDetail
source: Calculated Price
tr: Hesaplanan Fiyat

# purchasePriceStep
source: Purchase Price
tr: Alış Fiyatı

# salePriceStep
source: Sale Price (+40%)
tr: Satış Fiyatı (+%40)

# pinMismatch
source: PIN codes do not match!
tr: PIN kodları uyuşmuyor!

# createPinTitle
source: Create PIN Code
tr: PIN Kodu Oluştur

# newPinLabel
source: New PIN Code
tr: Yeni PIN Kodu

# confirmPinLabel
source: Confirm PIN Code
tr: PIN Kodunu Onayla

# createPinButton
source: Create PIN Code
tr: PIN Kodu Oluştur

# wrongOldPin
source: Old PIN code is incorrect!
tr: Eski PIN kodu yanlış!

# samePinError
source: New PIN code cannot be the same as the old PIN code!
tr: Yeni PIN kodu eski PIN kodu ile aynı olamaz!

# newPinMismatch
source: New PIN codes do not match!
tr: Yeni PIN kodları uyuşmuyor!

# updatePinTitle
source: Update PIN Code
tr: PIN Kodu Güncelle

# oldPinLabel
source: Old PIN Code
tr: Eski PIN Kodu

# confirmNewPinLabel
source: Confirm New PIN Code
tr: Yeni PIN Kodunu Onayla

# updatePinButton
source: Update PIN Code
tr: PIN Kodu Güncelle

source: Invalid JSON format
tr: Geçersiz JSON formatı

# productNameDetail
source: Product Name
tr: Ürün Adı

# usedRateDetail
source: Used Rate
tr: Kullanılan Kur

# cumulativeDiscountDetail
source: Cumulative Discount
tr: Kümülatif İndirim

source: Current Rate Calculation
tr: Güncel Kurlarla Hesaplama

# currentUsdRateDetail
source: Current USD Rate
tr: Güncel USD Kuru

# currentEurRateDetail
source: Current EUR Rate
tr: Güncel EUR Kuru

source: Calculation Steps
tr: Hesaplama Adımları

source: Currency Conversion
tr: Döviz Çevirimi

# cumulativeDiscountSteps
source: 2. Cumulative Discount Details
tr: 2. Kümülatif İndirim Detayı

# multipleDiscountApplied
source: (Multiple discounts applied cumulatively)
tr: (Birden fazla indirim kümülatif olarak uygulanmıştır)

# resultStep
source: → Result
tr: → Sonuç

# purchasePriceDetail
source: 3. Purchase Price
tr: 3. Alış Fiyatı

# purchaseVatDetail
source: 4. Purchase + VAT (20%)
tr: 4. Alış + KDV (%20)

# salePriceDetail
source: 5. Sale Price (+40% profit)
tr: 5. Satış Fiyatı (+%40 kar)

# saleVatDetail
source: 6. Sale + VAT (20%)
tr: 6. Satış + KDV (%20)

# priceChangeDetail
source: Difference (Old → New)
tr: Fark (Eski → Yeni)

# changeAmountDetail
source: Change
tr: Değişim

# updatePriceButtonDetail
source: Update Price
tr: Fiyatı Güncelle

# originalCalculationTitle
source: Original Calculation
tr: Orijinal Hesap

# calculationDateDetail
source: Calculation Date
tr: Hesaplama Tarihi

# notesDetail
source: Notes
tr: Notlar

# editPreset
source: Edit
tr: Düzenle

# usdRateManual
source: USD Rate
tr: USD Kuru

# eurRateManual
source: EUR Rate
tr: EUR Kuru

# tryRateManual
source: TRY Rate
tr: TL Kuru

source: Total Discount
tr: Toplam İskonto

# purchasePriceWithTax
source: Purchase + VAT
tr: Alış + KDV

# salePriceWithTax
source: Sale + VAT
tr: Satış + KDV

source: Profit Margin Details
tr: Kar Marjı Detayları

# enterPinToViewDetails
source: Enter PIN code to view profit margin details
tr: Kar marjı detaylarını görmek için PIN kodu girin

# editPresetTitle
source: Edit Preset
tr: Preset Düzenle

# discount1Percent
source: Discount 1 (%)
tr: İndirim 1 (%)

# discount2Percent
source: Discount 2 (%)
tr: İndirim 2 (%)

# discount3Percent
source: Discount 3 (%)
tr: İndirim 3 (%)

# profitMarginPercent
source: Profit Margin (%)
tr: Kar Marjı (%)

source: Update
tr: Güncelle

source: Preset updated successfully
tr: Preset başarıyla güncellendi

source: Enter PIN Code
tr: PIN Kodu Girin

# pinCodeHint
source: 4-8 digit PIN code
tr: 4-8 haneli PIN kodu

source: Invalid PIN code
tr: Hatalı PIN kodu

source: OK
tr: Tamam

# pinUpdatedSuccessfully
source: PIN code updated successfully
tr: PIN kodu başarıyla güncellendi

source: Cumulative Discount
tr: Kümülatif İndirim

# purchasePriceCalc
source: Purchase Price
tr: Alış Fiyatı

# manualExchangeRates
source: Exchange Rates (Manual)
tr: Döviz Kurları (Manuel)

source: Network Error
tr: Ağ Hatası

source: Validation Error
tr: Doğrulama Hatası

source: Storage Error
tr: Depolama Hatası

source: Authentication Error
tr: Kimlik Doğrulama Hatası

source: Calculation Error
tr: Hesaplama Hatası

source: File Error
tr: Dosya Hatası

source: Error
tr: Hata

source: Storage error occurred
tr: Depolama hatası oluştu

source: File operation failed
tr: Dosya işlemi başarısız

# unexpectedError
source: An unexpected error occurred
tr: Beklenmeyen bir hata oluştu

source: Calculation Summary
tr: Hesap Özeti

source: Used Rate
tr: Kullanılan Kur

source: Calculation Date
tr: Hesaplama Tarihi

source: Notes
tr: Notlar

source: Original Calculation
tr: Orijinal Hesap

source: Product Name
tr: Ürün Adı

# currencyConversionStep
source: Currency Conversion
tr: Döviz Çevirimi

# discountApplicationStep
source: Discount Application
tr: İndirim Uygulanması

# purchaseVatStep
source: Purchase + VAT (20%)
tr: Alış + KDV (%20)

# saleVatStep
source: Sale + VAT (20%)
tr: Satış + KDV (%20)

source: Current USD Rate
tr: Güncel USD Kuru

source: Current EUR Rate
tr: Güncel EUR Kuru

# currentTryRate
source: Current TL Rate
tr: Güncel TL Kuru

source: New Price
tr: Yeni Fiyat

# priceDifference
source: Difference
tr: Fark

# editOriginalPrice
source: Edit Price
tr: Fiyat Düzenle

source: New Original Price
tr: Yeni Orijinal Fiyat

source: Enter new price
tr: Yeni fiyatı girin

source: Price updated successfully
tr: Fiyat başarıyla güncellendi

source: Invalid price format
tr: Geçersiz fiyat formatı

source: Recalculate with New Price
tr: Yeni Fiyatla Hesapla

# priceGreaterThanZero
source: Price must be greater than zero
tr: Fiyat sıfırdan büyük olmalıdır

# priceTooLarge
source: Price is too large
tr: Fiyat çok büyük

source: Invalid percentage format
tr: Geçersiz yüzde formatı

source: Percentage cannot be negative
tr: Yüzde negatif olamaz

source: Percentage cannot be greater than 100
tr: Yüzde 100'den büyük olamaz

# presetLabelTooShort
source: Preset label must be at least 2 characters
tr: Preset etiketi en az 2 karakter olmalıdır

# presetLabelTooLong
source: Preset label cannot be longer than 50 characters
tr: Preset etiketi en fazla 50 karakter olabilir

# productNameTooShort
source: Product name must be at least 2 characters
tr: Ürün adı en az 2 karakter olmalıdır

# productNameTooLong
source: Product name cannot be longer than 100 characters
tr: Ürün adı en fazla 100 karakter olabilir

# pinCodeEmpty
source: PIN code cannot be empty
tr: PIN kodu boş olamaz

# pinCodeTooShort
source: PIN code must be at least 4 characters
tr: PIN kodu en az 4 karakter olmalıdır

# pinCodeTooLong
source: PIN code cannot be longer than 8 characters
tr: PIN kodu en fazla 8 karakter olabilir

# pinCodeOnlyNumbers
source: PIN code must contain only numbers
tr: PIN kodu sadece sayı içermelidir

source: Import/Export
tr: İçe/Dışa Aktar

# exportData
source: Export
tr: Dışa Aktar

# importData
source: Import
tr: İçe Aktar

# filePickerError
source: File picker error: {error}
tr: Dosya seçme hatası: {error}

source: No file selected
tr: Dosya seçilmedi

# fileSavedAt
source: File saved at: {path}
tr: Dosya kaydedildi: {path}

source: Select data to export
tr: Dışa aktarılacak verileri seçin

source: Include calculation records
tr: Hesap kayıtlarını dahil et

source: Include discount presets
tr: İndirim ön ayarlarını dahil et

source: Export
tr: Dışa Aktar

source: Import
tr: İçe Aktar

# exportDialogTitle
source: Data Export
tr: Veri Dışa Aktarma

# importDialogTitle
source: Data Import
tr: Veri İçe Aktarma

source: Clear All Data
tr: Tüm Verileri Temizle

# clearDataConfirmation
source: Are you sure you want to delete all data? This action cannot be undone.
tr: Tüm verileri silmek istediğinize emin misiniz? Bu işlem geri alınamaz.

# clearDataSuccess
source: All data cleared successfully
tr: Tüm veriler başarıyla temizlendi

# clearDataError
source: Data clearing error
tr: Veri temizleme hatası

# dataStats
source: Data Statistics
tr: Veri İstatistikleri

source: Calculation Records: {count}
tr: Hesap Kayıtları: {count}

source: Discount Presets: {count}
tr: İndirim Ön Ayarları: {count}

source: No data to export
tr: Dışa aktarılacak veri yok

source: Invalid file format
tr: Geçersiz dosya formatı

# confirmImport
source: Are you sure you want to import the selected file?
tr: Seçilen dosyayı içe aktarmak istediğinize emin misiniz?

# importWillOverwrite
source: Existing data will be overwritten
tr: Mevcut veriler üzerine yazılacak

# currentRateCalculationTitle
source: 📊 Current Rate Calculation
tr: 📊 Güncel Kurlarla Hesaplama

source: Update with Current Rate
tr: Güncel Kur ile Güncelle

source: Record updated with current rate
tr: Kayıt güncel kur ile güncellendi

# updateErrorMessage
source: Update error
tr: Güncelleme hatası

source: Product name already exists
tr: Bu ürün adı zaten mevcut

source: Validation check failed
tr: Doğrulama kontrolü başarısız

# cumulativeDiscountStep
source: Cumulative Discount
tr: Kümülatif İndirim

# purchasePriceStepCalc
source: Purchase Price
tr: Alış Fiyatı

# purchaseVatStepCalc
source: Purchase + VAT
tr: Alış + KDV

# salePriceStepCalc
source: Sale Price (+{margin}% profit)
tr: Satış Fiyatı (+%{margin} kar)

# finalPriceVatStep
source: Final Price (VAT Included)
tr: Final Fiyat (KDV Dahil)
